In [11]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

In [2]:
# 현재 시간

today = datetime.now()
today

datetime.datetime(2022, 8, 2, 9, 50, 12, 674396)

In [3]:
today.year

2022

In [4]:
today.month

8

In [5]:
today.day

2

In [6]:
today.microsecond

674396

In [7]:
# 현재 날짜에 일(day) 기준으로 더하기

today + timedelta(days = 10)

datetime.datetime(2022, 8, 12, 9, 50, 12, 674396)

In [8]:
# 현재 날짜에 주(week) 기준으로 더하기

today + timedelta(weeks = 3)

datetime.datetime(2022, 8, 23, 9, 50, 12, 674396)

In [9]:
# 월 기준으로는 더할 수 없음

today + timedelta(months = 2)

TypeError: 'months' is an invalid keyword argument for __new__()

In [12]:
data = pd.DataFrame({'date' : ['11/1/2020', '11/2/2020', '11/3/2020'], 'value' : [10, 20, 30]})
data

        date  value
0  11/1/2020     10
1  11/2/2020     20
2  11/3/2020     30

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   value   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [14]:
# 날짜 형식 변환

data['date'] = pd.to_datetime(data['date'])

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      datetime64[ns]
 1   value   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 176.0 bytes

In [16]:
# date 칼럼의 첫번째 줄의 day만 출력

data['date'].loc[0].day

1

In [17]:
data = pd.DataFrame({'date' : ['11-1-2020 1:11:11', '11-2-2020 2:11:11', '11-3-2020 3:11:11'], 'value' : [10, 20, 30]})
data

                date  value
0  11-1-2020 1:11:11     10
1  11-2-2020 2:11:11     20
2  11-3-2020 3:11:11     30

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   value   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [19]:
data['date'] = pd.to_datetime(data['date'])

In [20]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      datetime64[ns]
 1   value   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 176.0 bytes

In [21]:
# date 칼럼의 첫번째 데이터에서 second만 출력

data['date'].loc[0].second

11

In [22]:
data = pd.DataFrame({'date' : ['10-11-10', '10-11-11', '10-11-12'], 'value' : [10, 20, 30]})
data                           # 연 - 월 - 일

       date  value
0  10-11-10     10
1  10-11-11     20
2  10-11-12     30

In [23]:
pd.to_datetime(data['date'])     # 년, 월, 일로 적었는데 월, 일, 년으로 나옴

0   2010-10-11
1   2011-10-11
2   2012-10-11
Name: date, dtype: datetime64[ns]

In [24]:
# 연- 월- 일 순서 지정

pd.to_datetime(data['date'], format = '%y-%m-%d')

0   2010-11-10
1   2010-11-11
2   2010-11-12
Name: date, dtype: datetime64[ns]

# date 데이터

In [2]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

In [3]:
data = pd.read_excel('Superstore.xls')
data.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [4]:
data = data[['Order Date', 'Ship Date', 'Sales', 'Profit']]
data.head()

  Order Date  Ship Date     Sales    Profit
0 2016-11-08 2016-11-11  261.9600   41.9136
1 2016-11-08 2016-11-11  731.9400  219.5820
2 2016-06-12 2016-06-16   14.6200    6.8714
3 2015-10-11 2015-10-18  957.5775 -383.0310
4 2015-10-11 2015-10-18   22.3680    2.5164

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Order Date  9994 non-null   datetime64[ns]
 1   Ship Date   9994 non-null   datetime64[ns]
 2   Sales       9994 non-null   float64
 3   Profit      9994 non-null   float64
dtypes: datetime64[ns](2), float64(2)
memory usage: 312.4 KB

In [6]:
# Ship Date와 Order Date의 차이 칼럼 추가

data['gap'] = data['Ship Date'] - data['Order Date']
data

     Order Date  Ship Date     Sales    Profit    gap
0    2016-11-08 2016-11-11  261.9600   41.9136 3 days
1    2016-11-08 2016-11-11  731.9400  219.5820 3 days
2    2016-06-12 2016-06-16   14.6200    6.8714 4 days
3    2015-10-11 2015-10-18  957.5775 -383.0310 7 days
4    2015-10-11 2015-10-18   22.3680    2.5164 7 days
...         ...        ...       ...       ...    ...
9989 2014-01-21 2014-01-23   25.2480    4.1028 2 days
9990 2017-02-26 2017-03-03   91.9600   15.6332 5 days
9991 2017-02-26 2017-03-03  258.5760   19.3932 5 days
9992 2017-02-26 2017-03-03   29.6000   13.3200 5 days
9993 2017-05-04 2017-05-09  243.1600   72.9480 5 days

[9994 rows x 5 columns]

#### linear regression

In [7]:
from sklearn.linear_model import LinearRegression

In [8]:
X = data[['Profit', 'gap']]
y = data['Sales']

In [9]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Profit  9994 non-null   float64
 1   gap     9994 non-null   timedelta64[ns]
dtypes: float64(1), timedelta64[ns](1)
memory usage: 156.3 KB

In [10]:
X

        Profit    gap
0      41.9136 3 days
1     219.5820 3 days
2       6.8714 4 days
3    -383.0310 7 days
4       2.5164 7 days
...        ...    ...
9989    4.1028 2 days
9990   15.6332 5 days
9991   19.3932 5 days
9992   13.3200 5 days
9993   72.9480 5 days

[9994 rows x 2 columns]

In [11]:
model = LinearRegression()
model.fit(X, y)

TypeError: The DType <class 'numpy.dtype[float64]'> could not be promoted by <class 'numpy.dtype[timedelta64]'>. This means that no common DType exists for the given inputs. For example they cannot be stored in a single array unless the dtype is `object`. The full list of DTypes is: (<class 'numpy.dtype[float64]'>, <class 'numpy.dtype[timedelta64]'>)

- gap 칼럼의 경우 뒤에 days가 붙은 timedelta타입
- 이 형태 때문에 에러 발생

#### 해결방법1: gap 칼럼에서 숫자만 추출

In [12]:
# gap 칼럼에서 숫자 부분만 추출

X['gap'] = X['gap'].apply(lambda x: x.days)

C:\Users\park1\AppData\Local\Temp\ipykernel_14140\2236858877.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X['gap'] = X['gap'].apply(lambda x: x.days)

In [13]:
X

        Profit  gap
0      41.9136    3
1     219.5820    3
2       6.8714    4
3    -383.0310    7
4       2.5164    7
...        ...  ...
9989    4.1028    2
9990   15.6332    5
9991   19.3932    5
9992   13.3200    5
9993   72.9480    5

[9994 rows x 2 columns]

In [14]:
model.fit(X, y)

LinearRegression()

#### 해결방법2: unix timestamp 형태로 변경

In [15]:
data = pd.read_excel('Superstore.xls')
data.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [16]:
data = data[['Order Date', 'Ship Date', 'Sales', 'Profit']]
data.head()

  Order Date  Ship Date     Sales    Profit
0 2016-11-08 2016-11-11  261.9600   41.9136
1 2016-11-08 2016-11-11  731.9400  219.5820
2 2016-06-12 2016-06-16   14.6200    6.8714
3 2015-10-11 2015-10-18  957.5775 -383.0310
4 2015-10-11 2015-10-18   22.3680    2.5164

In [17]:
# scientific 형태로 보이는 것을 일반 숫자 형태로 변경하는 옵션

pd.set_option('display.float_format', lambda x: '%.0f' % x)

In [18]:
# datetime을 unix timestamp로 변환

data['Order Date'] = pd.to_numeric(data['Order Date']) / 10 ** 9
data['Ship Date'] = pd.to_numeric(data['Ship Date']) / 10 ** 9

In [20]:
# Ship Date와 Order Date의 차이 칼럼 추가

data['gap'] = data['Ship Date'] - data['Order Date']
data.head()

   Order Date  Ship Date  Sales  Profit    gap
0  1478563200 1478822400    262      42 259200
1  1478563200 1478822400    732     220 259200
2  1465689600 1466035200     15       7 345600
3  1444521600 1445126400    958    -383 604800
4  1444521600 1445126400     22       3 604800

In [21]:
X = data[['Profit', 'gap']]
y = data['Sales']

In [22]:
# unix timestamp도 에러 없이 모델링 가능

model = LinearRegression()
model.fit(X, y)

LinearRegression()